# Мими има закупени самолетни билети, но в последствие решава да си добави багаж към тях.
# Таксите за багаж се изчисляват въз основа на теглото на чекирания багаж:
# •	до 10кг – 20% от цената на багаж над 20кг
# •	между 10кг и 20кг вкл. – 50% от цената на багаж над 20кг.
# •	над 20кг – таксата се чете от конзолата
# В зависимост от броя на дните, които остават до пътуването, цената се оскъпява:
# •	повече от 30 дни - цената на багажа се оскъпява с 10%
# •	между 7 и 30 дни вкл. - цената на багажа се оскъпява с 15%
# •	по-малко от 7 дни - цената на багажа се оскъпява с 40%
# Напишете програма, която пресмята колко ще трябва да заплати Мими, спрямо горните условия.
# Вход:
# От конзолата се четат 4 реда:
# 1.	Цената на багаж над 20кг - реално число в диапазона [10.0…80.0]
# 2.	Килограми на багажа – реално число в диапазона [1.0…32.0]
# 3.	Дни до пътуването – цяло число в диапазона [1…60]
# 4.	Брой багажи – цяло число в диапазона [1…10]
# Изход
# Да се отпечата на конзолата сумата, която ще трябва да заплати Мими за багажите, в следния формат:
# •	" The total price of bags is: {цената на багажите} lv. "
# Сумата да бъде форматирана до втората цифра след десетичния знак.

price_above_twenty = float(input())
kg_luggage = float(input())
days_until_leave = int(input())
number_luggage = int(input())

total_price_luggage = 0

if kg_luggage < 10:
    total_price_luggage = 0.20 * price_above_twenty
elif 10 <= kg_luggage <= 20:
    total_price_luggage = 0.50 * price_above_twenty
else:
    total_price_luggage = price_above_twenty

if days_until_leave < 7:
    total_price_luggage *= 1.40
elif 7 <= days_until_leave <= 30:
    total_price_luggage *= 1.15
else:
    total_price_luggage *= 1.10

print(f'The total price of bags is: {total_price_luggage * number_luggage:.2f} lv.')