# Техниката в магазин за коледни украси се разваля. Артикулите, които съдържат четни числа в своя баркод не могат да
# бъдат маркирани от касиерите. Вашата задача е, да напишете програма, която генерира всички баркодове, които НЕ
# съдържат четни цифри в себе си.
# Вход:
# •	Две четирицифрени числа, които показват обхвата на баркодовете, които трябва да промените.
# •	Първи ред – четирицифрено число – началото на обхвата. Цяло число в интервала [1000…9999]
# •	Втори ред – четирицифрено число – края на обхвата. Цяло число в интервала [1000…9999]
# Изход:
# На конзолата трябва да се отпечатат всички "баркодове", които НЕ съдържат четна цифра в себе си, разделени с интервал.

start = input()
end = input()

s1, s2, s3, s4 = int(start[0]), int(start[1]), int(start[2]), int(start[3])
e1, e2, e3, e4 = int(end[0]), int(end[1]), int(end[2]), int(end[3])

for w in range(s1, e1 + 1):
    for x in range(s2, e2 + 1):
        for y in range(s3, e3 + 1):
            for z in range(s4, e4 + 1):
                if w % 2 != 0 and x % 2 != 0 and y % 2 != 0 and z % 2 != 0:
                    print(f'{w}{x}{y}{z}', end = ' ')

