# Дядо Коледа много обича да пътешества, но за съжаление се случило, така че точно преди да замине на почивка
# три от елените му се разболяли и трябва да ги остави. Когато заминава, той трябва да съобрази колко храна да
# остави на всеки един от елените, за да не останат гладни. Напишете програма, която пресмята дали оставената от
# Дядо Коледа храна ще е достатъчна за времето, в което него няма да го има. Всеки елен изяжда определено количество
# храна на ден.
# Вход:
# От конзолата се четат пет реда:
# •	Първи ред – брой дни, в които Дядо Коледа отсъства – цяло число в интервала [1…5000]
# •	Втори ред – оставена храна в килограми – цяло число в интервала [0…100000]
# •	Трети ред – храна на ден за първия елен в килограми – реално число в интервала [0.00…100.00]
# •	Четвърти ред – храна на ден за втория елен в килограми– реално число в интервала [0.00…100.00]
# •	Пети ред – храна на ден за третия елен в килограми – реално число в интервала [0.00…100.00]
# Изход:
# На конзолата трябва да се отпечата на един ред:
# •	Ако оставената храна Е достатъчна:
# o	“{килограми, които остават} kilos of food left.”
# 	Резултатът трябва да е закръглен към ПО-МАЛКОТО цяло число
# •	Ако оставената храна НЕ Е достатъчна:
# o	“{килограми, които не  недостигат} more kilos of food are needed.”
# 	Резултатът трябва да е закръглен към ПО-ГОЛЯМОТО цяло число

from math import floor, ceil

days_not_available = int(input())
left_food_kg = int(input())
first_deer_food_per_day_kg = float(input())
second_deer_food_per_day_kg = float(input())
third_deer_food_per_day_kg = float(input())

total_needed_food_kg = days_not_available * (first_deer_food_per_day_kg + second_deer_food_per_day_kg
                                             + third_deer_food_per_day_kg)

diff = abs(total_needed_food_kg - left_food_kg)

if total_needed_food_kg <= left_food_kg:
    print(f'{floor(diff)} kilos of food left.')
else:
    print(f'{ceil(diff)} more kilos of food are needed.')