# Напишете програма, която да умножава положителни числа по 2. От конзолата се четат поредица от реални числа, всяко
# на нов ред, докато не се въведе отрицателно. След всяко умножено число на нов ред да се отпечата
# "Result: {резултата от умножението}". Резултата от умножението да бъде форматиран до втория знак след десетичния
# разделител. При получаване на негативно число, на конзолата да се отпечата "Negative number!" и програмата да
# приключи изпълнение.

i = float(input())
result = 0

if i < 0:
    print('Negative number!')
else:
    while i >= 0:
        result = i * 2
        print(f'Result: {result:.2f}')
        i = float(input())
        if i < 0:
            print('Negative number!')
