# Басейн с обем V има две тръби от които се пълни. Всяка тръба има определен дебит (литрите вода минаващи
# през една тръба за един час). Работникът пуска тръбите едновременно и излиза за N часа.
# Напишете програма, която изкарва състоянието на басейна, в момента, когато работникът се върне.

# Вход
# От конзолата се четат четири реда:
# •	Първият ред съдържа числото V – Обем на басейна в литри – цяло число в интервала [1…10000].
# •	Вторият ред съдържа числото P1 – дебит на първата тръба за час – цяло число в интервала [1…5000].
# •	Третият ред съдържа числото P2 – дебит на втората тръба за час– цяло число в интервала [1…5000].
# •	Четвъртият ред съдържа числото H – часовете които работникът отсъства – реално число в интервала [1.0…24.00]

# Изход
# Да се отпечата на конзолата едно от двете възможни състояния:
# •	До колко се е запълнил басейна и коя тръба с колко процента е допринесла.
# o	"The pool is {запълненост на басейна в проценти}% full. Pipe 1: {процент вода от първата тръба}%.
# Pipe 2: {процент вода от втората тръба}%."
# Aко басейнът се е препълнил – с колко литра е прелял за даденото време.
# o	"For {часовете, които тръбите са пълнили вода} hours the pool overflows with {литрите вода в повече} liters."

V = int(input())
P1 = int(input())
P2 = int(input())
N = float(input())

total_water = (P1 + P2) * N

if total_water <= V:
    total_water_percent = total_water/V * 100
    P1_percent = P1*N/total_water * 100
    P2_percent = P2*N/total_water * 100
    print(f'The pool is {total_water_percent}% full. Pipe 1: {P1_percent:.2f}%. '
          f'Pipe 2: {P2_percent:.2f}%.')
else:
    diff = abs(V - total_water)
    print(f'For {N} hours the pool overflows with {diff:.2f} liters.')