# Марина обича да пътува. Тя има 3 домашни любимеца (куче, котка и костенурка). Когато заминава на
# пътешествие трябва да съобрази колко храна да им остави, за да не останат гладни. Напишете програма,
# която пресмята колко килограма храна ще изядат всички за времето, в което Марина отсъства и дали
# оставената храна от нея ще им е достатъчна. Всяко животно изяжда определено количество храна на ден.

# Вход
# От конзолата се четат пет реда:
# •	Първи ред – брой дни – цяло число в интервал [1…5000]
# •	Втори ред – оставена храна в килограми – цяло число в интервал [0…100000]
# •	Трети ред – храна на ден за кучето в килограми – реално число в интервал [0.00…100.00]
# •	Четвърти ред – храна на ден за котката в килограми– реално число в интервал [0.00…100.00]
# •	Пети ред – храна на ден за костенурката в грамове – реално число в интервал [0.00…10000.00]

# Изход
# На конзолата трябва да се отпечата на един ред:
# •	Ако оставената храна Е достатъчна:
# o	"{килограма остатък} kilos of food left."
# 	Резултатът трябва да е закръглен към по-ниското цяло число
# •	Ако оставената храна НЕ Е достатъчна:
# o	“{килограма недостигат} more kilos of food are needed.”
# 	Резултатът трябва да е закръглен към по-високото цяло число

from math import floor, ceil

days = int(input())
food = int(input())
dog_food = float(input())
cat_food = float(input())
turtle_food = float(input())

animals_total_food = (dog_food + cat_food + (turtle_food/1000)) * days
diff = abs(food - animals_total_food)

if animals_total_food <= food:
    diff = floor(diff)
    print(f'{diff} kilos of food left.')
else:
    diff = ceil(diff)
    print(f'{diff} more kilos of food are needed.')