# EXAM
# Учебната година вече е започнала и отговорничката на 10Б клас - Ани трябва да купи определен брой пакетчета
# с химикали, пакетчета с маркери, както и препарат за почистване на дъска. Тя е редовна клиентка на една книжарница,
# затова има намаление за нея, което представлява някакъв процент от общата сума. Напишете програма, която изчислява
# колко пари ще трябва да събере Ани, за да плати сметката, като имате предвид следния ценоразпис:
# •	Пакет химикали - 5.80 лв.
# •	Пакет маркери - 7.20 лв.
# •	Препарат - 1.20 лв (за литър)

# Вход
# От конзолата се четат 4 числа:
# •	Брой пакети химикали - цяло число в интервала [0...100]
# •	Брой пакети маркери - цяло число в интервала [0...100]
# •	Литри препарат за почистване на дъска - цяло число в интервала [0…50]
# •	Процент намаление - цяло число в интервала [0...100]

pen_numbers = int(input())
if 0 <= pen_numbers <= 100:
    marker_numbers = int(input())
    if 0 <= marker_numbers <= 100:
        chemical_litre = int(input())
        if 0 <= chemical_litre <= 50:
            percentage = float(input())
            if 0 <= percentage <= 100:
                sum = 5.80*pen_numbers + 7.20*marker_numbers + 1.20*chemical_litre
                total_sum = ((100-percentage)/100)*sum
                print(total_sum)
            else:
                print("Invalid percentage!")
        else:
            print("Invalid litre of chemical!")
    else:
        print("Invalid number of markers!")
else:
    print("Invalid number of pens!")