# От лозе с площ X квадратни метри се заделя 40% от реколтата за производство на вино. От 1 кв.м лозе
# се изкарват Y килограма грозде. За 1 литър вино са нужни 2,5 кг. грозде. Желаното количество вино за продан
# е Z литра.
# Напишете програма, която пресмята колко вино може да се произведе и дали това количество е достатъчно.
# Ако е достатъчно, остатъкът се разделя по равно между работниците на лозето.

# Вход
# Входът се чете от конзолата и се състои от точно 4 реда:
# •	1ви ред: X кв.м е лозето – цяло число в интервала [10 … 5000]
# •	2ри ред: Y грозде за един кв.м – реално число в интервала [0.00 … 10.00]
# •	3ти ред: Z нужни литри вино – цяло число в интервала [10 … 600]
# •	4ти ред: брой работници – цяло число в интервала [1 … 20]

# Изход
# На конзолата трябва да се отпечата следното:
# •	Ако произведеното вино е по-малко от нужното:
# o	“It will be a tough winter! More {недостигащо вино} liters wine needed.”
# 	Резултатът трябва да е закръглен към по-ниско цяло число
# •	Ако произведеното вино е колкото или повече от нужното:
# o	“Good harvest this year! Total wine: {общо вино} liters.”
# 	Резултатът трябва да е закръглен към по-ниско цяло число
# o	“{Оставащо вино} liters left -> {вино за 1 работник} liters per person.”
# 	И двата резултата трябва да са закръглени към по-високото цяло число

from math import floor, ceil

x = int(input())
y = float(input())
z = int(input())
workers_number = int(input())

wine_l = 0.40 * x * y / 2.5
diff = abs(wine_l - z)

if wine_l < z:
    diff = floor(diff)
    print(f'It will be a tough winter! More {diff} liters wine needed.')
else:
    wine_l = floor(wine_l)
    diff = ceil(diff)
    wine_per_worker = ceil(diff/workers_number)
    print(f'Good harvest this year! Total wine: {wine_l} liters.')
    print(f'{diff} liters left -> {wine_per_worker} liters per person.')