# Мария иска да купи подарък на сина си. Тя работи в магазин за цветя. В магазина идва поръчка за цветя.
# Напишете програма, която пресмята сумата от поръчката и дали печалбата е достатъчна за подаръка.
# Цветята има следните цени:
# •	Магнолии – 3.25 лева
# •	Зюмбюли – 4 лева
# •	Рози – 3.50 лева
# •	Кактуси – 8 лева
# От общата сума, Мария трябва да плати 5% данъци.

# Вход
# Входът се чете от конзолата и се състои от 5 реда:
# •	Брой магнолии – цяло число в интервала [0 … 50]
# •	Брой зюмбюли – цяло число в интервала [0 … 50]
# •	Брой рози – цяло число в интервала [0 … 50]
# •	Брой кактуси – цяло число в интервала [0 … 50]
# •	Цена на подаръка – реално число в интервала [0.00 … 500.00]

# Изход
# На конзолата трябва да се отпечата един ред.
# •	Ако парите СА стигнали: "She is left with {останали} leva." – сумата трябва да е закръглена към по-малко
# цяло число (пр. 1.90 -> 1).
# •	Ако парите НЕ достигат: "She will have to borrow {останали} leva." – сумата трябва да е закръглена към
# по-голямо цяло число (пр. 1.10 -> 2).
import math

m = int(input())
z = int(input())
r = int(input())
k = int(input())
present_price = float(input())

flowers_total = (m * 3.25 + z * 4 + r * 3.50 + k * 8) * 0.95
diff = abs(present_price - flowers_total)

if present_price <= flowers_total:
    diff = math.floor(diff)
    print(f'She is left with {diff} leva.')
else:
    diff = math.ceil(diff)
    print(f'She will have to borrow {diff} leva.')