# Деси има рожден ден на Великден и иска да организира парти за своите приятели. Тя знае какъв е броят гости,
# които иска да покани и колко е кувертът за всеки гост. От броя гости зависи и каква отстъпка ще получи за куверта
# за един човек.
# Ако покани:
# •	Между 10 (вкл.) и 15 (вкл.) човека -> 15 % отстъпка от куверта за един човек
# •	Между 15 и 20 (вкл.) човека -> 20 % отстъпка от куверта за един човек
# •	Над 20 човека -> 25 % отстъпка от куверта за един човек
# Деси трябва да предвиди и закупуването на торта за партито. Цената на тортата е 10% от бюджета на Деси.
# Напишете програма, която изчислява дали бюджетът на Деси ще и е достатъчен за партито.
# Вход
# От конзолата се четат 3 реда:
# 1.	Брой гости – цяло число в интервала [1...99]
# 2.	Цена на куверт за един човек – реално число в интервала [0.00 … 99.00]
# 3.	Бюджетът на Деси  – реално число в интервала [0.00 … 9999.00]
# Изход
# На конзолата да се отпечата един ред:
# •	Ако бюджетът  е достатъчен:
# o	"It is party time! {останали пари} leva left."
# •	Ако бюджетът не е достатъчен:
# o	"No party! {недостигащи пари} leva needed."
# Резултатът да бъде форматиран до втория знак след десетичната запетая.

guests = int(input())
price_per_guest = float(input())
budget = float(input())

if 10 <= guests <= 15:
    price_per_guest *= 0.85
elif 15 < guests <= 20:
    price_per_guest *= 0.80
elif guests > 20:
    price_per_guest *= 0.75

cake = 0.10 * budget

total_price = guests * price_per_guest + cake
diff = abs(total_price - budget)

if total_price <= budget:
    print(f'It is party time! {diff:.2f} leva left.')
else:
    print(f'No party! {diff:.2f} leva needed.')