# Отговаряте за логистиката на различни товари. В зависимост от теглото на товара е нужно различно превозно средство.
# Цената на тон, за която се превозва товара е различна за всяко превозно средство:
# •	До 3 тона – микробус (200 лева на тон)
# •	От 4 до 11 тона – камион (175 лева на тон)
# •	12 и повече тона – влак (120 лева на тон)
# Вашата задача е да изчислите средната цена на тон превозен товар, както и процента на тоновете  превозвани с
# всяко превозно средство, спрямо общото тегло(в тонове) на всички товари.
# Вход
# От конзолата се четат поредица от числа, всяко на отделен ред:
# •	На първия ред – броя на товарите за превоз – цяло число в интервала [1...1000]
# •	За всеки един товар на отделен ред – тонажа на товара – цяло число в интервала [1...1000]
# Изход
# Да се отпечатат на конзолата 4 реда, както следва:
# •	Първи ред – средната цена на тон превозен товар (закръглена до втория знак след дес. запетая);
# •	Втори ред – процентът тона превозвани с микробус (процент между 0.00% и 100.00%);
# •	Трети ред – процентът  тона превозвани с камион (процент между 0.00% и 100.00%);
# •	Четвърти ред – процентът тона превозвани с влак (процент между 0.00% и 100.00%).

load_number = int(input())
bus_tones, truck_tones, train_tones = 0, 0, 0
total_tones = 0

for load in range(1, load_number + 1):
    load_tones = int(input())
    total_tones += load_tones

    if load_tones <= 3:
        bus_tones += load_tones
    elif 4 <= load_tones <= 11:
        truck_tones += load_tones
    else:
        train_tones += load_tones

total_sum = bus_tones * 200 + truck_tones * 175 + train_tones * 120
average_sum = total_sum/total_tones

print(f'{average_sum:.2f}')
print(f'{bus_tones/total_tones * 100:.2f}%')
print(f'{truck_tones/total_tones * 100:.2f}%')
print(f'{train_tones/total_tones * 100:.2f}%')
