# Българският лекоатлет Тихомир Иванов започва тренировки за предстоящото европейско първенство по лека атлетика на
# в Глазгоу, Шотландия.
# Вашата задача е да напишете софтуер, с който Иванов да следи своя прогрес и дали е достигнал желаните резултати.
# В началото програмата получава желаната височина на летвата от Тихомир, той започва тренировката си като поставя
# летвата на височина 30см по-ниско от целта. За всяка височина той има право на 3 скока, като за да бъде един скок
# успешен, той трябва да бъде над височината на летвата. При успешен скок (над летвата), височината й се вдига с 5
# сантиметра. При три неуспешни скока на една и съща височина, тренировката приключва с неуспех. При достигане на
# желаната височина и нейното успешно прескачане, тренировката приключва с успех.
# Вход
# Входът е поредица от цели числа в интервала [100…300]:
# •	На първия ред се прочита желаната от Тихомир Иванов височина в сантиметри
# •	На всеки следващ ред до приключване на програмата се прочита височината от скока на Иванов
# Изход
# На конзолата трябва да се отпечата един ред:
# •	Ако Тихомир не успее да преодолее желаната височина:
# o	"Tihomir failed at {височина на летвата към момента на провала}cm after {брой скокове от началото на тренировката}
# jumps."
# •	Ако Тихомир успее да преодолее височината:
# o	"Tihomir succeeded, he jumped over {височина на прескочената последно летва}cm after {брой скокове за цялата
# тренировка} jumps."

aim = int(input())

count_jumps = 0
fails = False
count_fails = 0

height_bar = aim - 30

while height_bar <= aim:
    jump_height = int(input())

    count_jumps += 1
    # if jump_height > aim:
    #     total_success = True
    #     break

    if jump_height > height_bar:
        height_bar += 5
        count_fails = 0
    else:
        count_fails += 1

    if count_fails == 3:
        fails = True
        break

if fails:
    print(f'Tihomir failed at {height_bar}cm after {count_jumps} jumps.')
else:
    print(f'Tihomir succeeded, he jumped over {aim}cm after {count_jumps} jumps.')

# По условие трябва да започнеш да прочиташ височината за скока на Иван след като влезеш в цикъла - премести
# прочитането на вход от ред 10 в началото на цикъла, веднага след влизането в него и махни прочитането, което е преди
# излизането от цикъла. Условието на самия цикъл трябва да бъде (changedDesiredHeight <= desiredHeight), а не
# (currentJump < desiredHeight), защото искаме да сравняваме до каква височина на летвата спрямо желаната височина е
# стигнал Иван след всеки успешен скок, а не колко е скочил в момента спрямо желаната височина, като трябва да има и =,
# защото при положение, че Иван достигне височина на летвата, която е равна на желаната първоначална височина, той е
# успял. Задай и начална стойност 0 на брояча за общия брой скокове, и премести инкрементирането му преди if-else
# проверките. Накрая промени changedDesiredHeight при печатането на ред 37 - трябва да бъде desiredHeight, защото това
# е началната желана височина.