# Дадени са n цели числа в интервала [1…1000]. От тях някакъв процент p1 се делят без остатък на 2, друг процент p2
# се делят без остатък на 3, друг процент p3 се делят без остатък на 4. Да се напише програма, която изчислява
# и отпечатва процентите p1, p2 и p3.
#
# Вход
# На първия ред от входа стои цялото число n (1 ≤ n ≤ 1000) – брой числа.
# На следващите n-на брой реда стои по едно цяло число в интервала [1…1000] – числата които да бъдат проверени на колко се делят.
# Изход
# Да се отпечатат на конзолата 3 реда, всеки от които съдържа процент между 0% и 100%, с точност две цифри след
# десетичната точка, например 25.00%, 66.67%, 57.14%.
# •	На първият ред – процентът на числата които се делят на 2
# •	На вторият ред – процентът на числата които се делят на 3
# •	На третият ред – процентът на числата които се делят на 4

n = int(input())

p1, p2, p3 = 0, 0, 0

for _ in range(1, n + 1):
    number = int(input())

    if number % 2 == 0 and number % 4 == 0 and number % 3== 0:
        p1 += 1
        p2 += 1
        p3 += 1
    elif number % 2 == 0 and number % 4 == 0 and number % 3 != 0:
        p1 += 1
        p3 += 1
    elif number %2 == 0 and number % 4 != 0 and number % 3 != 0:
        p1 += 1
    elif number % 2 != 0 and number % 4 == 0 and number % 3 != 0:
        p3 += 1
    elif number % 2 != 0 and number % 4 != 0 and number % 3 == 0:
        p2 += 1
    elif number % 2 == 0 and number % 4 != 0 and number % 3 == 0:
        p1 += 1
        p2 += 1

p1_percent = p1 / n * 100
p2_percent = p2 / n * 100
p3_percent = p3 / n * 100

print(f'{p1_percent:.2f}%')
print(f'{p2_percent:.2f}%')
print(f'{p3_percent:.2f}%')