# Всяка година Дядо Коледа избира различни дестинации за почивка. Тази година той решава да прекара почивните си дни в
# България. Неговите верни приятели – джуджетата, му предлагат да се настани в един от най-престижните хотели, а именно
# "Четири сезона". По време на престоя си там, той трябва да избере между следните видове помещения, със следните цени
# за престой:
# •	"room for one person" – 18.00 лв за нощувка
# •	"apartment" – 25.00 лв за нощувка
# •	"president apartment" – 35.00 лв за нощувка
# Според броят на дните, в които Дядо Коледа ще остане в хотела (пример: 11 дни = 10 нощувки) и видът на помещението,
# което ще избере, той може да ползва различно намаление. Намаленията спрямо дните и помещението са както следва:
# вид помещение	по-малко от 10 дни	между 10 и 15 дни	повече от 15 дни
# room for one person	не ползва намаление	не ползва намаление	не ползва намаление
# apartment	30% от крайната цена	35% от крайната цена	50% от крайната цена
# president apartment	10% от крайната цена	15% от крайната цена	20% от крайната цена
#
# След престоя си в хотела, оценката на Дядо Коледа за услугите на хотела може да е позитивна (positive) или негативна
# (negative). Ако оценката му е позитивна, към цената с вече приспаднатото намаление Дядо Коледа добавя 25%  към нея.
# Ако оценката му е негативна приспада от цената 10%.
# Вход
# Входът се чете от конзолата и се състои от три реда:
# •	Първи ред – дни за престой – цяло число в интервала [0...365]
# •	Втори ред –  вид помещение –  "room for one person",  "apartment" или "president apartment"
# •	Трети ред –  оценка - "positive"  или "negative"
# Изход
# На конзолата трябва да се отпечата един ред.
# •	Цената за престоят му в хотела, форматирана до втория знак след десетичната запетая

days = int(input())
type_of_room = input()
rate = input()

nights = days - 1

price_per_night = 0

if type_of_room == 'room for one person':
        price_per_night = 18
elif type_of_room == 'apartment':
    if days < 10:
        price_per_night = 25 * 0.70
    elif 10 <= days <= 15:
        price_per_night = 25 * 0.65
    else:
        price_per_night = 25 * 0.50
elif type_of_room == 'president apartment':
    if days < 10:
        price_per_night = 35 * 0.90
    elif 10 <= days <= 15:
        price_per_night = 35 * 0.85
    else:
        price_per_night = 35 * 0.80

total_price = price_per_night * nights

if rate == 'positive':
    total_price = 1.25 * total_price
elif rate == 'negative':
    total_price = 0.90 * total_price

print(f'{total_price:.2f}')