# Фирма за компютри е наела Вас, за да изчислите възможните продажби. Да се напише програма, която за определен вид
# компютри пресмята средния рейтинг и направените продажби. Първо се въвежда едно число от конзолата, което представлява
# броя на моделите компютри. След това последователно за всеки от моделите компютри се въвежда по едно число:
# •	Последната цифра (единиците) на това число представлява рейтингът, който е в интервала [2…6].
# •	Останалите цифри (стотици и десетици) са възможните продажби, които ще се осъществят.
# Компютърната продажба се скалира на база рейтинг:
# •	Рейтинг 2 взима 0% от  възможните продажби.
# •	Рейтинг 3 взима 50% от възможните продажби.
# •	Рейтинг 4 взима 70% от възможните продажби.
# •	Рейтинг 5 взима 85% от възможните продажби.
# •	Рейтинг 6 взима 100% от възможните продажби.
# Вход
# От конзолата се прочита:
# На първия ред:
# •	n - брой компютри - цяло число в интервала [1…10]
# На следващите n реда:
# •	Числото, представляващо възможните продажби и рейтинга - цяло число в интервала [32…306]
# Изход
# На конзолата се отпечатват 2 редa:
# •	Броят направени продажби
# •	Средноаритметичният рейтинг за всички компютри
# Продажбите и рейтингът трябва да са форматирани до втората цифра след десетичната запетая.

computers_number = int(input())
total_rating = 0
avg_rating = 0
sales_number = 0

for _ in range(1, computers_number + 1):
    number = input()
    possible_sales = 0

    current_rating = int(number[len(number)-1])
    total_rating += current_rating

    possible_sales = int(number) // 10

    if current_rating == 2:
        sales_number += possible_sales * 0
    elif current_rating == 3:
        sales_number += possible_sales * 0.50
    elif current_rating == 4:
        sales_number += possible_sales * 0.70
    elif current_rating == 5:
        sales_number += possible_sales * 0.85
    elif current_rating == 6:
        sales_number += possible_sales

avg_rating = total_rating / computers_number

print(f'{sales_number:.2f}')
print(f'{avg_rating:.2f}')


