# Катерачи от цяла България се събират на групи и набелязват следващите върхове за изкачване. Според размера на групата,
# катерачите ще изкачват различни върхове.
# •	Група до 5 човека – изкачват Мусала
# •	Група от 6 до 12 човека – изкачват Монблан
# •	Група от 13 до 25 човека – изкачват Килиманджаро
# •	Група от 26 до 40 човека –  изкачват К2
# •	Група от 41 или повече човека – изкачват Еверест
# Да се напише програма, която изчислява процента на катерачите изкачващи всеки връх.
# Вход
# От конзолата се четат поредица от числа, всяко на отделен ред:
# •	На първия ред – броя на групите от катерачи – цяло число в интервала [1...1000]
# •	За всяка една група на отделен ред – броя на хората в групата – цяло число в интервала [1...1000]
# Изход
# Да се отпечатат на конзолата 5 реда, всеки от които съдържа процент между 0.00% и 100.00% с точност до втората цифра
# след десетичната запетая.
# •	Първи ред - процентът изкачващи Мусала
# •	Втори ред – процентът изкачващи Монблан
# •	Трети ред – процентът изкачващи Килиманджаро
# •	Четвърти ред – процентът изкачващи К2
# •	Пети ред – процентът изкачващи Еверест

groups_number = int(input())
g1, g2, g3, g4, g5 = 0, 0, 0, 0, 0

count_people = 0

for _ in range(groups_number):
    people_per_group = int(input())
    count_people += people_per_group
    if people_per_group <= 5:
        g1 += people_per_group
    elif 6 <= people_per_group <= 12:
        g2 += people_per_group
    elif 13 <= people_per_group <= 25:
        g3 += people_per_group
    elif 26 <= people_per_group <= 40:
        g4 += people_per_group
    else:
        g5 += people_per_group

print(f'{g1/count_people * 100:.2f}%')
print(f'{g2/count_people * 100:.2f}%')
print(f'{g3/count_people * 100:.2f}%')
print(f'{g4/count_people * 100:.2f}%')
print(f'{g5/count_people * 100:.2f}%')
