# Екипът на СофтУни си организира футболен турнир. Първоначално прочитаме от конзолата капацитета на
# стадиона и броят на всички фенове. След това за всеки фен се чете секторът, в който се намира.
# Феновете на първия отбор са в сектор А и Б, а на втория – В и Г. Да се напише програма, която изчислява
# процентите на феновете във всеки сектор, спрямо общия брой фенове на стадиона, както и общият процент
# на феновете за двата отбора, спрямо капацитета на стадиона. Общият брой на феновете НЕ надвишава капацитета
# на стадиона.
# Вход
# От конзолата се четат поредица от числа, всяко на отделен ред:
# 1.	Капацитетът на стадиона – цяло число в интервала [1 … 10000];
# 2.	Броят на всички фенове – цяло число в интервала [1 … 10000].
# За всеки един фен, на отделен ред се прочита:
# 1.	Секторът, на който се намира – текст – "A", "B", "V" и "G".
# Изход
# Да се отпечатат на конзолата 5 реда, всеки от които съдържа процент между 0.00% и 100.00%,
# форматирани до втората цифра след десетичната запетая:
# 1.	Процентът на феновете в сектор А
# 2.	Процентът на феновете в сектор Б
# 3.	Процентът на феновете в сектор В
# 4.	Процентът на феновете в сектор Г
# 5.	Процентът на всички фенове, спрямо капацитета на стадиона.

capacity_stadium = int(input())
fans_number = int(input())

sector_A, sector_B, sector_V, sector_G, team_1, team_2 = 0, 0, 0, 0, 0, 0

for _ in range(1, fans_number + 1):
    which_sector = input()

    if which_sector == 'A':
        sector_A += 1
    elif which_sector == 'B':
        sector_B += 1
    elif which_sector == 'V':
        sector_V += 1
    elif which_sector == 'G':
        sector_G += 1

sector_A_percentage = sector_A / fans_number * 100
sector_B_percentage = sector_B / fans_number * 100
sector_V_percentage = sector_V / fans_number * 100
sector_G_percentage = sector_G / fans_number * 100

fans_percentage = fans_number / capacity_stadium * 100

print(f'{sector_A_percentage:.2f}%')
print(f'{sector_B_percentage:.2f}%')
print(f'{sector_V_percentage:.2f}%')
print(f'{sector_G_percentage:.2f}%')
print(f'{fans_percentage:.2f}%')