# Напишете програма, която чете ъгъл в радиани (десетично число) и го преобразува в градуси. Използвайте формулата:
# градус = радиан * 180 / π. Числото π в Python може да достъпите чрез модула math. За да ползвате функционалността
# му, първо трябва да включите констатата pi.

# 1.	Прочетете входните данни от конзолата (радианите).
# 2.	Създайте нова променлива, в която ще направите конвертирането от радиани към градуси,
# като знаете формулата за изчисление.
# 3.	Принтирайте получените градуси.

from math import pi

radians = float(input())

degrees = radians*180/pi

print(degrees)
