# Напишете програма, която чете от конзолата две шестцифрени цели числа. Винаги първото въведено число ще бъде по-малко
# от второто. На конзолата да се отпечатат на 1, ред разделени с интервал, всички числа, които се намират между двете,
# прочетени от конзолата числа и отговарят на условието сумата от цифрите на четни и нечетни позиции да са равни.
# Ако няма числа, отговарящи на условието на конзолата не се извежда резултат.

num1 = int(input())
num2 = int(input())

for number in range(num1, num2 + 1):
    number = str(number)
    sum_even = 0
    sum_odd = 0

    for index in range(len(str(number))):

        if index % 2 == 0:
            sum_even += int(number[index])
        else:
            sum_odd += int(number[index])

    if sum_even == sum_odd:
        print(number, end = ' ')