# Да се напише програма, която генерира трицифрени PIN кодове, като цифрите на всеки PIN код са в определен интервал.
# За да бъде валиден един PIN код той трябва да отговаря на следните условия:
# •	Първата и третата цифра трябва да бъдат четни.
# •	Втората цифра трябва да бъде просто число в диапазона [2...7].
# Вход
# От конзолата се четат 3 реда:
# •	Горната граница на първото число - цяло число в диапазона [1...9]
# •	Горната граница на второто число - цяло число в диапазона [1...9]
# •	Горната граница на третото число - цяло число в диапазона [1...9]
# Изход
# Да се отпечатат на конзолата всички валидни трицифрени PIN кодове, чиито цифри отговарят на съответните интервали.

first_upper_limit = int(input())
second_upper_limit = int(input())
third_upper_limit = int(input())

for x in range(1, first_upper_limit + 1):
    for y in range(1, second_upper_limit + 1):
        for z in range(1, third_upper_limit + 1):
            if x % 2 == 0 and z % 2 == 0 and y in [2, 3, 5, 7]:
                print(f'{x} {y} {z}')