# Ани се страхува от това, да не й бъде хакнат някой от профилите в социалните мрежи, затова
# решава да направи генератор за пароли, които да бъдат достатъчно сигурни. Вашата задача е да й
# помогнете да напише програма, която ще генерира тези пароли, разделени една от друга от знака "|".
# Да се напише програма, която генерира серия от символи като в шаблона:
# ABxyBA
# като при всяко генериране на нов код, стойностите на символите се увеличават с 1. Ако A надхвърли 55,
# се връща на 35. Ако B надхвърли 96, се връща на 64.
# Вход
# От конзолата се чете 1 ред:
# •	На първия ред a – цяло число в интервала [1 … 1000]
# •	На втория ред b – цяло число в интервала [1 … 1000]
# •	На третия ред максимален брой генерирани пароли – цяло число в интервала [1 … 1000000]
# Ограничения:
# •	A е символ с ASCII стойност в диапазона [35… 55]
# •	B е символ с ASCII стойност в диапазона [64 … 96]
# •	x e цяло число в диапазона [1… a]
# •	y e цяло число в диапазона [1… b]
# Изход:
# Да се отпечата на конзолата:
# •	Генерираният код. Ако броят на комбинациите е по-голям от максималния на кода, да се отпечата до
# подадената стойност, в противен случай да се отпечата до текущия брой на комбинациите.

a = int(input())
b = int(input())
max_passwords = int(input())

count_passwords = 0
enough_passwords = False
A = 35
B = 64

for x in range(1, a + 1):
    for y in range(1, b + 1):
        if A > 55:
            A = 35

        if B > 96:
            B = 64

        print(f'{chr(A)}{chr(B)}{x}{y}{chr(B)}{chr(A)}', end = '|')
        A += 1
        B += 1
        count_passwords += 1

        if count_passwords == max_passwords:
            enough_passwords = True
            break

    if enough_passwords:
        break

