# В града има тайна врата, за която всички знаят, но никой не е успявал да я отключи и да види какво има зад нея.
# За да бъде отключена трябва да се въведе трицифрен код.
# Напишете програма, която генерира комбинации спрямо въведени числа – предположения от потребителя. От конзолата се
# въвеждат три цифри. Тези цифри ще бъдат горната граница, до която ние искаме да получим всички трицифрени числа,
# на които всяка една цифра отговаря на следните условия:
# •	Цифрата на единиците и цифрата на стотиците трябва да бъде четна
# •	Цифрата на десетиците да бъде просто число в диапазона (2...7).
# Това ще са възможните комбинации според въведените предположения от потребителя, с които ще може евентуално да
# се отключи вратата.
# Вход
# От конзолата се четат 3 реда:
# •	Горната граница на стотиците - цяло число в диапазона (1-9)
# •	Горната граница на десетиците - цяло число в диапазона (1-9)
# •	Горната граница на единиците - цяло число в диапазона (1-9)
# Изход
# Да се отпечатат на конзолата всички трицифрени числа, за които всяка една част отговаря на условията по-горе.

hundreds_upper_limit = int(input())
tens_upper_limit = int(input())
units_upper_limit = int(input())

for x in range(1, hundreds_upper_limit + 1):
    for y in range(1, tens_upper_limit + 1):
        for z in range(1, units_upper_limit + 1):
            if x % 2 == 0 and z % 2 == 0 and y in [2, 3, 5, 7]:
                print(f'{x} {y} {z}')