# Имаме банкноти и монети по 1лв., по 2лв. и по 5лв. Да се напише програма, която прочита въведените от
# потребителя брой банкноти и монети и сума, и извежда на екран всички възможни начини по които сумата може
# да се изплати с наличните банкноти.
# Вход
# Входът се чете от конзолата и съдържа точно 4 реда:
# 1.	Брой монети по 1лв. - цяло положително число;
# 2.	Брой монети по 2лв. - цяло положително число;
# 3.	Брой банкноти по 5лв. - цяло положително число;
# 4.	Сума - цяло положително число в интервала [1…1000];
# Изход
# Да се отпечатат на конзолата всички комбинации от дадените номинали, образуващи сумата, форматирани по
# следния начин:
# o	"{бр. 1лв.} * 1 lv. + {бр. 2лв.} * 2 lv. + {бр. 5лв.} * 5 lv. = {сума} lv."

one_lv = int(input())
two_lvs = int(input())
five_lvs = int(input())
total_sum = int(input())

for x in range(one_lv + 1):
    for y in range(two_lvs + 1):
        for z in range(five_lvs + 1):
            total = z * 5 + y * 2 + x * 1

            if total == total_sum:
                print(f'{x} * 1 lv. + {y} * 2 lv. + {z} * 5 lv. = {total_sum} lv.')