# Задача 1. Басейн
# Преподавателският екип на СофтУни организира работен ден на басейн по случай настъпването на лятото.
# Вашата задача е да напишете програма, която да изчислява каква сума трябва да се заплати.
# За всеки един човек от екипа трябва да се заплати такса вход. Трябва да имате предвид, че един чадър стига за
# двама души. Знае се, че само 75% от екипа искат шезлонги. При изчислението на броя на чадърите и шезлонгите,
# техният брой да се закръгли до по-голямото цяло число.

# Вход
# От конзолата се четат 4 числа:
# 1.	Първи ред – брой на хората. Цяло число в интервала [1…100]
# 2.	Втори ред – такса вход. Реално число в интервала [0.00…50.00]
# 3.	Трети ред – цена един за шезлонг. Реално число в интервала [0.00…50.00]
# 4.	Четвърти ред – цена за един чадър. Реално число в интервала [0.00...50.00]

# Изход
# "{сумата за покриване на разходите} lv."
# Резултатът да се форматира до втората цифра след десетичния знак.

from math import ceil

people = int(input())
entry_price = float(input())
lounge_price = float(input())
umbrella_price = float(input())

total_entry_price = people*entry_price
total_umbrella_price = ceil(people/2)*umbrella_price
total_lounge_price = ceil(0.75*people)*lounge_price

total = total_lounge_price + total_umbrella_price + total_entry_price

print(f'{total:.2f} lv.')
