# Задачата ви е да напишете програма, която приема името на отбор и прави статистика за него.
# През един сезон всеки отбор изиграва определен брой футболни срещи, като за всяка среща на отбора се дават
# точки в зависимост от изхода от срещата. Има три възможни изхода от една среща:
# 	W - Отборът е победител и получава 3 точки
# 	D - Срещата е завършила без победител и отборът получава 1 точка
# 	L - Отборът е загубил срещата и не получава точки
# Напишете програма, която приема името на футболен отбор и извежда неговата статистика, на база на изиграните
# срещи през този сезон. Неговата статистика трябва да включва общия брой спечелени точки през настоящия сезон,
# подробна статистика за изхода на изиграните игри и процент победи през сезона. Ако отборът по някаква причина
# не е играл мачове през настоящия сезон се извежда специално съобщение.
# Вход
# От конзолата се четат два реда:
# •	Името на футболния отбор, за който водим статистика - текст
# •	Броя изиграни срещи през настоящия сезон - цяло число в интервала [0… 100]
#  За всяка изиграна среща се прочита отделен ред:
# o	Резултатът от изиграната среща в един от горепосочените формати – символ с възможности 'W', 'D' и 'L'
# Изход
# В зависимост от това дали отборът е играл мачове през настоящия сезон се извеждат два вида изход.
# •	Ако отборът не е изиграл нито един мач през настоящия сезон се извежда точно един ред в следния формат:
# o	"{името на отбора} hasn't played any games during this season."
# •	Ако отборът е изиграл един мач или повече се извеждат шест реда в следния формат:
# o	"{името на отбора} has won {брой спечелени точки} points during this season"
# o	"Total stats:"
# o	"## W: {брой спечелени игри}"
# o	"## D: {брой игри, завършили наравно}"
# o	"## L: {брой загубени игри}"
# o	"Win rate: {процент спечелени игри}%"
# Процентът спечелени игри трябва да бъде форматиран до втората цифра след десетичния знак.

name_team = input()
matches_number = int(input())

total_points = 0
w_count = 0
d_count = 0
l_count = 0

if matches_number == 0:
    print(f"{name_team} hasn't played any games during this season.")
else:
    for _ in range(1, matches_number + 1):
        match_outcome = input()

        if match_outcome == 'W':
            w_count += 1
            total_points += 3
        elif match_outcome == 'D':
            d_count += 1
            total_points += 1
        elif match_outcome == 'L':
            l_count += 1

    print(f'{name_team} has won {total_points} points during this season.')
    print('Total stats:')
    print(f'## W: {w_count}')
    print(f'## D: {d_count}')
    print(f'## L: {l_count}')
    print(f'Win rate: {w_count / matches_number * 100:.2f}%')

